; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v3 - type_1 ?v1 - type_3)
 	      (pred_1 ?v7 - object ?v1 - type_3)
	      (pred_4 ?v3 - type_1 ?v6 - type_2)
	      (pred_2 ?v3 - type_1 ?v7 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v3 - type_1 ?v8 ?v2 - type_3)
       :precondition (and  (pred_3 ?v3 ?v8))
       :effect (and  (pred_3 ?v3 ?v2)
		     (not (pred_3 ?v3 ?v8))))

   (:action op_3
       :parameters (?v3 - type_1 ?v4 - object ?v5 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v5) (pred_3 ?v3 ?v5) (pred_4 ?v3 ?v6))
       :effect (and (pred_2 ?v3 ?v4 ?v6)
		    (not (pred_1 ?v4 ?v5)) 
		    (not (pred_4 ?v3 ?v6))))

   (:action op_1
       :parameters (?v3 - type_1 ?v4 - object ?v5 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v4 ?v6) (pred_3 ?v3 ?v5))
       :effect (and (pred_1 ?v4 ?v5)
		    (pred_4 ?v3 ?v6)
		    (not (pred_2 ?v3 ?v4 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_07 obj_11 - type_1
obj_01 obj_05 obj_03 obj_04 - type_2
obj_08 obj_06 obj_10 obj_13 - type_3
obj_02 obj_09 obj_12 - object)
(:init
(pred_3 obj_07 obj_13)
(pred_4 obj_07 obj_01)
(pred_4 obj_07 obj_05)
(pred_3 obj_11 obj_06)
(pred_4 obj_11 obj_03)
(pred_4 obj_11 obj_04)
(pred_1 obj_02 obj_06)
(pred_1 obj_09 obj_10)
(pred_1 obj_12 obj_13)
)
(:goal
(and
(pred_1 obj_02 obj_13)
(pred_1 obj_09 obj_08)
(pred_1 obj_12 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_07 obj_13) (pred_3 obj_11 obj_13))))
  )
)
)

; plan
1. (op_3 obj_11 obj_02 obj_06 obj_04)
   deleted: (pred_1 obj_02 obj_06) (pred_4 obj_11 obj_04)
   added: (pred_2 obj_11 obj_02 obj_04)
   goals met: 0 of 3
2. (op_3 obj_07 obj_12 obj_13 obj_05)
   deleted: (pred_1 obj_12 obj_13) (pred_4 obj_07 obj_05)
   added: (pred_2 obj_07 obj_12 obj_05)
   goals met: 0 of 3
3. (op_2 obj_07 obj_13 obj_10)
   deleted: (pred_3 obj_07 obj_13)
   added: (pred_3 obj_07 obj_10)
   goals met: 0 of 3
4. (op_2 obj_11 obj_06 obj_13)
   deleted: (pred_3 obj_11 obj_06)
   added: (pred_3 obj_11 obj_13)
   goals met: 0 of 3
5. (op_1 obj_11 obj_02 obj_13 obj_04)
   deleted: (pred_2 obj_11 obj_02 obj_04)
   added: (pred_1 obj_02 obj_13) (pred_4 obj_11 obj_04)
   goals met: 1 of 3
6. (op_1 obj_07 obj_12 obj_10 obj_05)
   deleted: (pred_2 obj_07 obj_12 obj_05)
   added: (pred_1 obj_12 obj_10) (pred_4 obj_07 obj_05)
   goals met: 2 of 3
7. (op_3 obj_07 obj_09 obj_10 obj_01)
   deleted: (pred_1 obj_09 obj_10) (pred_4 obj_07 obj_01)
   added: (pred_2 obj_07 obj_09 obj_01)
   goals met: 2 of 3
8. (op_2 obj_07 obj_10 obj_08)
   deleted: (pred_3 obj_07 obj_10)
   added: (pred_3 obj_07 obj_08)
   goals met: 2 of 3
9. (op_1 obj_07 obj_09 obj_08 obj_01)
   deleted: (pred_2 obj_07 obj_09 obj_01)
   added: (pred_1 obj_09 obj_08) (pred_4 obj_07 obj_01)
   goals met: 3 of 3
